app/Controllers/UserController.php

SELECT *
FROM `users`
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index()
    {
        $model = new UserModel();

        $search = $this->request->getGet('search');

        if ($search) {

            $users = $model
                ->like('name', $search)
                ->orLike('email', $search)
                ->paginate(5);

        } else {

            $users = $model->paginate(5);

INSERT INTO `users` (`name`, `email`, `avatar`) VALUES ('Kurt Russel B. Zarate', 'barlaanjulysis@gmail.com', 'uploads/1779980906_7ae469f8ad56b11e82d4.jpg')
---

                $model = new UserModel();

                $model->save([

                    'name' =>
                        $this->request->getPost('name'),

                    'email' =>
                        $this->request->getPost('email'),

                    'avatar' =>
                        'uploads/' . $newName
                ]);